## import pandas as pd
df=pd.read_csv(r"C:\Users\Shivam Yadav\Downloads\ecommerce.csv")

In [173]:
df.columns

Index(['order_id', 'customer_id', 'order_date', 'product_category', 'quantity',
       'price', 'payment_method', 'city', 'sales'],
      dtype='object')

In [174]:
#1. Filter all orders where Quantity is greater than 3.
df[df["quantity"]>3]

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales
0,1,8270,2021-11-14,Clothing,5,3715.147893,Credit Card,Mumbai,18575.739467
2,3,6390,2023-06-14,Clothing,7,3460.151686,Cash,Bangalore,24221.061802
4,5,6734,2022-10-27,Electronics,5,2180.346501,Cash,Kolkata,10901.732504
8,9,6578,2020-08-21,Electronics,4,2575.586824,Cash,Chennai,10302.347295
9,10,9322,2022-05-22,Sports,9,1821.462187,Cash,Kolkata,16393.159679
...,...,...,...,...,...,...,...,...,...
49992,49993,8143,2021-07-03,Electronics,6,4448.421355,Debit Card,Kolkata,26690.528129
49995,49996,4836,2022-07-18,Sports,8,3028.799509,Credit Card,Mumbai,24230.396074
49996,49997,8309,2021-10-03,Clothing,6,1195.550123,Wallet,Hyderabad,7173.300736
49997,49998,8381,2020-02-13,Home,7,3594.290174,Credit Card,Chennai,25160.031217
49999,50000,9683,2021-10-23,Electronics,4,2950.205358,Credit Card,Bangalore,11800.821431

In [175]:
#2. Filter all rows where Product_Category is Electronics.
df[df["product_category"]=="Electronics"]

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales
1,2,1860,2020-10-30,Electronics,1,711.940587,UPI,Delhi,711.940587
4,5,6734,2022-10-27,Electronics,5,2180.346501,Cash,Kolkata,10901.732504
8,9,6578,2020-08-21,Electronics,4,2575.586824,Cash,Chennai,10302.347295
10,11,2685,2021-05-07,Electronics,4,4994.700744,Credit Card,Chennai,19978.802976
16,17,7420,2020-09-21,Electronics,4,4698.869591,UPI,Kolkata,18795.478362
...,...,...,...,...,...,...,...,...,...
49986,49987,2972,2021-04-23,Electronics,3,1146.826508,Cash,Bangalore,3440.479525
49988,49989,5222,2021-07-22,Electronics,7,4234.501136,Debit Card,NaN,29641.507955
49992,49993,8143,2021-07-03,Electronics,6,4448.421355,Debit Card,Kolkata,26690.528129
49994,49995,5871,2020-01-07,Electronics,1,100.262439,Cash,Hyderabad,100.262439
49999,50000,9683,2021-10-23,Electronics,4,2950.205358,Credit Card,Bangalore,11800.821431

In [176]:
#3. Show only those orders where Price is between 500 and 2000.
df[(df["price"]>=500)&(df["price"]<2000)]

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales
1,2,1860,2020-10-30,Electronics,1,711.940587,UPI,Delhi,711.940587
6,7,1466,2023-04-09,Sports,1,598.618266,Credit Card,Delhi,598.618266
9,10,9322,2022-05-22,Sports,9,1821.462187,Cash,Kolkata,16393.159679
12,13,7949,2023-10-22,Toys,6,1791.746316,Debit Card,Hyderabad,10750.477895
13,14,3433,2020-08-16,Clothing,1,1482.188441,Debit Card,Kolkata,1482.188441
...,...,...,...,...,...,...,...,...,...
49986,49987,2972,2021-04-23,Electronics,3,1146.826508,Cash,Bangalore,3440.479525
49987,49988,8767,2022-06-12,Home,3,1316.777838,Credit Card,Hyderabad,3950.333514
49989,49990,5714,2020-04-14,Sports,7,989.274465,Cash,Hyderabad,6924.921256
49991,49992,8661,2022-05-04,Sports,7,1130.420437,Credit Card,Chennai,7912.943059
49996,49997,8309,2021-10-03,Clothing,6,1195.550123,Wallet,Hyderabad,7173.300736

In [177]:
#4. Show all orders where Product_Category is Grocery AND City is Mumbai.
df[(df["product_category"]=="Grocery")&(df["city"]=="Mumbai")]

Empty DataFrame
Columns: [order_id, customer_id, order_date, product_category, quantity, price, payment_method, city, sales]
Index: []

In [178]:
#5. Filter orders where Quantity is greater than 2 AND Payment_Type is Card.
df[(df["quantity"]>2)&(df["payment_method"].isin(["Credit Card","Debit Card"]))]

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales
0,1,8270,2021-11-14,Clothing,5,3715.147893,Credit Card,Mumbai,18575.739467
5,6,7265,2020-09-12,Home,3,3404.098964,Debit Card,Mumbai,10212.296891
10,11,2685,2021-05-07,Electronics,4,4994.700744,Credit Card,Chennai,19978.802976
12,13,7949,2023-10-22,Toys,6,1791.746316,Debit Card,Hyderabad,10750.477895
15,16,6051,2020-03-17,Toys,5,1894.029734,Credit Card,Hyderabad,9470.148671
...,...,...,...,...,...,...,...,...,...
49992,49993,8143,2021-07-03,Electronics,6,4448.421355,Debit Card,Kolkata,26690.528129
49995,49996,4836,2022-07-18,Sports,8,3028.799509,Credit Card,Mumbai,24230.396074
49997,49998,8381,2020-02-13,Home,7,3594.290174,Credit Card,Chennai,25160.031217
49998,49999,5474,2023-05-02,Sports,3,2792.963572,Debit Card,Hyderabad,8378.890715
49999,50000,9683,2021-10-23,Electronics,4,2950.205358,Credit Card,Bangalore,11800.821431

In [179]:
#6. Show records where Product_Category is Clothing OR Product_Category is Sports.
df[(df["product_category"]=="Clothing")|(df["product_category"]=="Sports")]

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales
0,1,8270,2021-11-14,Clothing,5,3715.147893,Credit Card,Mumbai,18575.739467
2,3,6390,2023-06-14,Clothing,7,3460.151686,Cash,Bangalore,24221.061802
3,4,6191,2023-06-07,Sports,2,3115.073329,UPI,Chennai,6230.146659
6,7,1466,2023-04-09,Sports,1,598.618266,Credit Card,Delhi,598.618266
9,10,9322,2022-05-22,Sports,9,1821.462187,Cash,Kolkata,16393.159679
...,...,...,...,...,...,...,...,...,...
49989,49990,5714,2020-04-14,Sports,7,989.274465,Cash,Hyderabad,6924.921256
49991,49992,8661,2022-05-04,Sports,7,1130.420437,Credit Card,Chennai,7912.943059
49995,49996,4836,2022-07-18,Sports,8,3028.799509,Credit Card,Mumbai,24230.396074
49996,49997,8309,2021-10-03,Clothing,6,1195.550123,Wallet,Hyderabad,7173.300736
49998,49999,5474,2023-05-02,Sports,3,2792.963572,Debit Card,Hyderabad,8378.890715

In [180]:
#7. Show orders where City is Delhi OR City is Pune.
df[(df["city"]=="Delhi")|(df["city"]=="Pune")]

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales
1,2,1860,2020-10-30,Electronics,1,711.940587,UPI,Delhi,711.940587
6,7,1466,2023-04-09,Sports,1,598.618266,Credit Card,Delhi,598.618266
17,18,2184,2022-01-13,Electronics,2,2494.894802,Debit Card,Delhi,4989.789604
20,21,7396,2023-01-19,Sports,8,368.656020,Wallet,Delhi,2949.248158
22,23,3558,2023-06-10,Toys,9,124.914513,Wallet,Delhi,1124.230620
...,...,...,...,...,...,...,...,...,...
49969,49970,3042,2021-09-17,Clothing,4,1334.306917,Wallet,Delhi,5337.227668
49972,49973,8793,2023-09-16,NaN,2,4383.654279,Credit Card,Delhi,8767.308558
49982,49983,6599,2022-12-15,Clothing,7,362.073503,UPI,Delhi,2534.514518
49984,49985,2124,2022-10-31,Electronics,3,4435.222633,Credit Card,Delhi,13305.667900
49993,49994,9947,2021-09-23,NaN,2,325.966115,UPI,Delhi,651.932229

In [181]:
#Section 4: Bucketing using Function and Apply
"""Define a function called amount_bucket that returns:
– High if Quantity * Price >= 5000
– Medium if between 2000 and 4999
– Low if below 2000"""
df["sales"]=(df["quantity"]*df["price"])
def amount_bucket(x):
    
    if (x>=5000):
        return "High"
    elif (x>=2000 and x<4999):
        return "Medium"
    else:
        return "Low"
df["amount_bucket"]=df["sales"].apply(amount_bucket)
df.head().round()

,order_id,customer_id,order_date,product_category,quantity,price,payment_method,city,sales,amount_bucket
0,1,8270,2021-11-14,Clothing,5,3715.0,Credit Card,Mumbai,18576.0,High
1,2,1860,2020-10-30,Electronics,1,712.0,UPI,Delhi,712.0,Low
2,3,6390,2023-06-14,Clothing,7,3460.0,Cash,Bangalore,24221.0,High
3,4,6191,2023-06-07,Sports,2,3115.0,UPI,Chennai,6230.0,High
4,5,6734,2022-10-27,Electronics,5,2180.0,Cash,Kolkata,10902.0,High

In [182]:
#8. Create a new column called Amount.
df=df.rename(columns={"price":"Amount"})

In [183]:
df

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket
0,1,8270,2021-11-14,Clothing,5,3715.147893,Credit Card,Mumbai,18575.739467,High
1,2,1860,2020-10-30,Electronics,1,711.940587,UPI,Delhi,711.940587,Low
2,3,6390,2023-06-14,Clothing,7,3460.151686,Cash,Bangalore,24221.061802,High
3,4,6191,2023-06-07,Sports,2,3115.073329,UPI,Chennai,6230.146659,High
4,5,6734,2022-10-27,Electronics,5,2180.346501,Cash,Kolkata,10901.732504,High
...,...,...,...,...,...,...,...,...,...,...
49995,49996,4836,2022-07-18,Sports,8,3028.799509,Credit Card,Mumbai,24230.396074,High
49996,49997,8309,2021-10-03,Clothing,6,1195.550123,Wallet,Hyderabad,7173.300736,High
49997,49998,8381,2020-02-13,Home,7,3594.290174,Credit Card,Chennai,25160.031217,High
49998,49999,5474,2023-05-02,Sports,3,2792.963572,Debit Card,Hyderabad,8378.890715,High
49999,50000,9683,2021-10-23,Electronics,4,2950.205358,Credit Card,Bangalore,11800.821431,High

In [184]:
#Section 5: Date Conversion
"""You must convert Order_Date from string to datetime format.

10. Convert Order_Date to datetime using pandas.to_datetime."""
df["order_date"]=pd.to_datetime(df["order_date"])

In [185]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          50000 non-null  int64
 1   customer_id       50000 non-null  int64
 2   order_date        50000 non-null  datetime64[ns]
 3   product_category  48500 non-null  object
 4   quantity          50000 non-null  int64
 5   Amount            50000 non-null  float64
 6   payment_method    48500 non-null  object
 7   city              48500 non-null  object
 8   sales             50000 non-null  float64
 9   amount_bucket     50000 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(3), object(4)
memory usage: 3.8+ MB

In [186]:
#11. Sort the dataset by Order_Date after conversion.
df= df.sort_values(by="order_date", ascending=False)
df.head()

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket
31251,31252,3284,2023-12-30,Clothing,6,2833.539235,Wallet,Kolkata,17001.235410,High
46965,46966,1644,2023-12-30,Sports,7,3660.853331,Credit Card,Mumbai,25625.973319,High
9548,9549,1100,2023-12-30,Toys,6,4707.081786,Debit Card,Mumbai,28242.490714,High
33596,33597,5556,2023-12-30,Home,7,292.674082,Wallet,Hyderabad,2048.718574,Medium
42721,42722,9796,2023-12-30,Clothing,3,4704.315279,Wallet,Kolkata,14112.945838,High

In [187]:
#12. Extract a new column Month from Order_Date.
df["Month"]=df["order_date"].dt.month

In [188]:
df.columns

Index(['order_id', 'customer_id', 'order_date', 'product_category', 'quantity',
       'Amount', 'payment_method', 'city', 'sales', 'amount_bucket', 'Month'],
      dtype='object')

In [189]:
#13. Extract Year from Order_Date.
df.drop(columns="Month")

df["Year"]=df["order_date"].dt.year

In [206]:
df["Month"].reset_index()

       index  Month
0      31251     12
1      46965     12
2       9548     12
3      33596     12
4      42721     12
...      ...    ...
49995  47904      1
49996  19190      1
49997  44195      1
49998   3073      1
49999  12669      1

[50000 rows x 2 columns]

In [191]:
#14. Filter all orders placed in the month of March.
df[df["Month"]==3]

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket,Month,Year
13970,13971,7015,2023-03-31,Sports,8,4087.878714,Credit Card,Delhi,32703.029709,High,3,2023
4718,4719,9448,2023-03-31,Clothing,6,3139.952357,Cash,Kolkata,18839.714144,High,3,2023
47518,47519,2212,2023-03-31,Sports,4,1774.808176,Cash,Hyderabad,7099.232704,High,3,2023
23537,23538,7640,2023-03-31,Home,1,647.804015,Debit Card,Delhi,647.804015,Low,3,2023
44866,44867,7578,2023-03-31,Home,1,508.604664,NaN,Kolkata,508.604664,Low,3,2023
...,...,...,...,...,...,...,...,...,...,...,...,...
44579,44580,7010,2020-03-01,Toys,7,494.155161,Credit Card,Delhi,3459.086130,Medium,3,2020
23953,23954,2685,2020-03-01,NaN,2,3278.609050,Wallet,Bangalore,6557.218099,High,3,2020
49278,49279,6366,2020-03-01,Electronics,1,1412.019525,Cash,Mumbai,1412.019525,Low,3,2020
1185,1186,4294,2020-03-01,Electronics,2,2534.444674,Credit Card,Hyderabad,5068.889347,High,3,2020
2303,2304,5654,2020-03-01,Toys,8,1188.967520,UPI,Chennai,9511.740160,High,3,2020

In [192]:
#15. Count total orders per Year.
df.groupby("Year")["quantity"].count().reset_index()

   Year  quantity
0  2020     12621
1  2021     12548
2  2022     12375
3  2023     12456

In [193]:
#16. Create a pivot table showing total Quantity per Product_Category.
df.pivot_table(index="product_category",values="quantity",aggfunc="sum")

                  quantity
product_category
Clothing             49262
Electronics          47530
Home                 48416
Sports               48458
Toys                 48292

In [194]:
#17. Create a pivot table showing total Amount per City.
df.pivot_table(index="city",values="Amount",aggfunc="sum").round()

               Amount
city
Bangalore  20496500.0
Chennai    20874625.0
Delhi      20634492.0
Hyderabad  20675191.0
Kolkata    20711714.0
Mumbai     20357763.0

In [195]:
#18. Create a pivot table with Payment_Type as rows and Product_Category as columns with sum of Amount.
df.pivot_table(index="payment_method",columns="product_category",values="Amount",aggfunc="sum").round()

product_category   Clothing  Electronics       Home     Sports       Toys
payment_method
Cash              4747574.0    4653393.0  4838116.0  4963240.0  4771760.0
Credit Card       4816354.0    4807363.0  4817512.0  4739817.0  4834544.0
Debit Card        4964974.0    4777133.0  4662431.0  5022021.0  4849132.0
UPI               4861675.0    4641336.0  4832862.0  4796311.0  4796130.0
Wallet            4923314.0    4909394.0  4588083.0  4605379.0  4896112.0

In [196]:
#19. Create a pivot table with City and Year on rows, Product_Category on columns, and sum of Quantity.
df.pivot_table(index=["city","Year"],columns="product_category",values="quantity",aggfunc="sum")

product_category  Clothing  Electronics  Home  Sports  Toys
city      Year
Bangalore 2020        2143         1792  2230    2001  2042
          2021        1925         1983  2020    1951  1917
          2022        1857         1914  1737    2138  2250
          2023        1971         1898  1817    1938  1892
Chennai   2020        2118         1964  1880    2088  2201
          2021        2054         1954  2043    2039  1787
          2022        1960         1896  2067    1811  1902
          2023        2124         1759  2067    1829  1874
Delhi     2020        2058         1983  2060    1973  1909
          2021        2085         1816  2118    2014  2015
          2022        2093         1794  1978    1924  1802
          2023        1897         1978  1972    1973  1802
Hyderabad 2020        1962         1930  1692    2028  2014
          2021        1987         1979  1925    1811  1871
          2022        1920         1934  1828    1952  2056
          2023        1834         1879  1788    2046  2061
Kolkata   2020        1712         1836  1968    1848  1932
          2021        2045         1925  2093    1767  1961
          2022        2086         1967  1878    2119  1851
          2023        1853         2042  2091    2094  2117
Mumbai    2020        1850         1981  2066    1975  1954
          2021        1987         2009  1792    1896  1842
          2022        2182         1841  1897    1964  1808
          2023        2004         1923  1896    1919  2014

In [197]:
#20. Create a matrix pivot with Month on rows, Payment_Type on columns showing count of Order_ID.
matrix=df.pivot_table(index="Month",columns="payment_method",values="order_id",aggfunc="count")
matrix

payment_method  Cash  Credit Card  Debit Card  UPI  Wallet
Month
1                881          781         886  876     833
2                741          814         756  710     782
3                780          802         774  856     778
4                770          814         863  789     791
5                865          791         831  841     795
6                849          811         785  790     774
7                841          845         784  782     784
8                844          789         855  854     838
9                825          746         778  805     800
10               801          803         870  817     827
11               779          839         794  782     738
12               756          830         826  832     827

In [198]:
#21. Filter all records where Payment_Type is in the list [Card, UPI]
df[df["payment_method"].isin(["Credit Card","Debit Card","UPI"])]

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket,Month,Year
46965,46966,1644,2023-12-30,Sports,7,3660.853331,Credit Card,Mumbai,25625.973319,High,12,2023
9548,9549,1100,2023-12-30,Toys,6,4707.081786,Debit Card,Mumbai,28242.490714,High,12,2023
3341,3342,7160,2023-12-30,Toys,2,4125.182852,UPI,Chennai,8250.365704,High,12,2023
35891,35892,7625,2023-12-30,Electronics,1,190.518354,Debit Card,Hyderabad,190.518354,Low,12,2023
33324,33325,7870,2023-12-30,Sports,7,982.125311,Debit Card,Hyderabad,6874.877174,High,12,2023
...,...,...,...,...,...,...,...,...,...,...,...,...
36727,36728,6198,2020-01-01,NaN,1,108.436511,Credit Card,Mumbai,108.436511,Low,1,2020
49593,49594,1199,2020-01-01,Clothing,1,4823.823549,Credit Card,Bangalore,4823.823549,Medium,1,2020
47882,47883,5968,2020-01-01,Clothing,9,2521.993581,UPI,Kolkata,22697.942229,High,1,2020
47904,47905,7870,2020-01-01,Electronics,1,1579.650842,Credit Card,Chennai,1579.650842,Low,1,2020
44195,44196,9888,2020-01-01,Home,1,1753.968166,UPI,Mumbai,1753.968166,Low,1,2020

In [199]:
#22. Filter records where City is in [Mumbai, Delhi, Kolkata].
df[df["city"].isin(["Mumbai","Delhi","Kolkata"])]

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket,Month,Year
31251,31252,3284,2023-12-30,Clothing,6,2833.539235,Wallet,Kolkata,17001.235410,High,12,2023
46965,46966,1644,2023-12-30,Sports,7,3660.853331,Credit Card,Mumbai,25625.973319,High,12,2023
9548,9549,1100,2023-12-30,Toys,6,4707.081786,Debit Card,Mumbai,28242.490714,High,12,2023
42721,42722,9796,2023-12-30,Clothing,3,4704.315279,Wallet,Kolkata,14112.945838,High,12,2023
35448,35449,6405,2023-12-30,NaN,3,2802.705791,UPI,Mumbai,8408.117372,High,12,2023
...,...,...,...,...,...,...,...,...,...,...,...,...
36727,36728,6198,2020-01-01,NaN,1,108.436511,Credit Card,Mumbai,108.436511,Low,1,2020
47882,47883,5968,2020-01-01,Clothing,9,2521.993581,UPI,Kolkata,22697.942229,High,1,2020
19190,19191,5994,2020-01-01,Clothing,3,1475.830527,Wallet,Kolkata,4427.491582,Medium,1,2020
44195,44196,9888,2020-01-01,Home,1,1753.968166,UPI,Mumbai,1753.968166,Low,1,2020
12669,12670,9014,2020-01-01,Toys,5,2959.146012,NaN,Delhi,14795.730059,High,1,2020

In [200]:
#23. Create a new column called Discount_Flag with the following logic:
#If Price > 1500 then Yes else No.
def Discount_Flag(x):
    if x>1500:
        return "Yes"
    else:
        return "No"
df["Discount_Flag"]=df["Amount"].apply(Discount_Flag)
df.head()

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket,Month,Year,Discount_Flag
31251,31252,3284,2023-12-30,Clothing,6,2833.539235,Wallet,Kolkata,17001.235410,High,12,2023,Yes
46965,46966,1644,2023-12-30,Sports,7,3660.853331,Credit Card,Mumbai,25625.973319,High,12,2023,Yes
9548,9549,1100,2023-12-30,Toys,6,4707.081786,Debit Card,Mumbai,28242.490714,High,12,2023,Yes
33596,33597,5556,2023-12-30,Home,7,292.674082,Wallet,Hyderabad,2048.718574,Medium,12,2023,No
42721,42722,9796,2023-12-30,Clothing,3,4704.315279,Wallet,Kolkata,14112.945838,High,12,2023,Yes

In [201]:
#24. Create a new column called High_Quantity_Flag where Quantity > 4 then Mark High else Normal.
def High_Quantity_Flag(x):
    if x>4:
        return "High"
    else:
        return "Normal"
df["High_Quantity_Flag"]=df["quantity"].apply(High_Quantity_Flag)
df.head()

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket,Month,Year,Discount_Flag,High_Quantity_Flag
31251,31252,3284,2023-12-30,Clothing,6,2833.539235,Wallet,Kolkata,17001.235410,High,12,2023,Yes,High
46965,46966,1644,2023-12-30,Sports,7,3660.853331,Credit Card,Mumbai,25625.973319,High,12,2023,Yes,High
9548,9549,1100,2023-12-30,Toys,6,4707.081786,Debit Card,Mumbai,28242.490714,High,12,2023,Yes,High
33596,33597,5556,2023-12-30,Home,7,292.674082,Wallet,Hyderabad,2048.718574,Medium,12,2023,No,High
42721,42722,9796,2023-12-30,Clothing,3,4704.315279,Wallet,Kolkata,14112.945838,High,12,2023,Yes,Normal

In [202]:
#25. Create a Profit column using if logic:
#If Product_Category is Electronics profit = Amount * 0.12 else Amount * 0.08.
def Profit(row):
    if row["product_category"] == "Electronics":
        return row["Amount"] * 0.12
    else:
        return row["Amount"] * 0.08

df["Profit"] = df.apply(Profit, axis=1)

In [203]:
df

,order_id,customer_id,order_date,product_category,quantity,Amount,payment_method,city,sales,amount_bucket,Month,Year,Discount_Flag,High_Quantity_Flag,Profit
31251,31252,3284,2023-12-30,Clothing,6,2833.539235,Wallet,Kolkata,17001.235410,High,12,2023,Yes,High,226.683139
46965,46966,1644,2023-12-30,Sports,7,3660.853331,Credit Card,Mumbai,25625.973319,High,12,2023,Yes,High,292.868267
9548,9549,1100,2023-12-30,Toys,6,4707.081786,Debit Card,Mumbai,28242.490714,High,12,2023,Yes,High,376.566543
33596,33597,5556,2023-12-30,Home,7,292.674082,Wallet,Hyderabad,2048.718574,Medium,12,2023,No,High,23.413927
42721,42722,9796,2023-12-30,Clothing,3,4704.315279,Wallet,Kolkata,14112.945838,High,12,2023,Yes,Normal,376.345222
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
47904,47905,7870,2020-01-01,Electronics,1,1579.650842,Credit Card,Chennai,1579.650842,Low,1,2020,Yes,Normal,189.558101
19190,19191,5994,2020-01-01,Clothing,3,1475.830527,Wallet,Kolkata,4427.491582,Medium,1,2020,No,Normal,118.066442
44195,44196,9888,2020-01-01,Home,1,1753.968166,UPI,Mumbai,1753.968166,Low,1,2020,Yes,Normal,140.317453
3073,3074,4212,2020-01-01,Sports,8,2439.403433,Wallet,Chennai,19515.227466,High,1,2020,Yes,High,195.152275
12669,12670,9014,2020-01-01,Toys,5,2959.146012,NaN,Delhi,14795.730059,High,1,2020,Yes,High,236.731681